src/test/testtool/GeefLijstZaakdocumenten_Lv01/03/adapter-in.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xsi:schemaLocation="http://www.egem.nl/StUF/sector/zkn/0310 zkn0310-p28\vraagAntwoord\zkn0310_msg_vraagAntwoord_resolved.xsd" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:ZKN="http://www.egem.nl/StUF/sector/zkn/0310" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Header />
    <SOAP-ENV:Body>
        <ZKN:zakLv01>
            <ZKN:stuurgegevens>
                <StUF:berichtcode>Lv01</StUF:berichtcode>
                <StUF:zender>
                    <StUF:organisatie>1900</StUF:organisatie>
                    <StUF:applicatie>GWS4all</StUF:applicatie>
                    <StUF:gebruiker>Gebruiker</StUF:gebruiker>
                </StUF:zender>
                <StUF:ontvanger>
                    <StUF:organisatie>1900</StUF:organisatie>
                    <StUF:applicatie>CDR</StUF:applicatie>
                </StUF:ontvanger>
                <StUF:referentienummer>06bcf242-7629-4048-9e8f-378dd25dc119</StUF:referentienummer>
                <StUF:tijdstipBericht>20220913160702725</StUF:tijdstipBericht>
                <StUF:entiteittype>ZAK</StUF:entiteittype>
            </ZKN:stuurgegevens>
            <ZKN:parameters>
                <StUF:sortering>0</StUF:sortering>
                <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
                <StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
                <StUF:indicatorAantal>false</StUF:indicatorAantal>
            </ZKN:parameters>
            <ZKN:gelijk StUF:entiteittype="ZAK">
                <ZKN:identificatie>1900244</ZKN:identificatie>
            </ZKN:gelijk>
            <ZKN:scope>
                <ZKN:object StUF:entiteittype="ZAK">
                    <ZKN:heeftRelevant StUF:entiteittype="ZAKEDC">
                        <ZKN:gerelateerde StUF:entiteittype="EDC">
                            <ZKN:identificatie xsi:nil="true" />
                            <ZKN:creatiedatum xsi:nil="true" />
                            <ZKN:ontvangstdatum xsi:nil="true" />
                            <ZKN:titel xsi:nil="true" />
                            <ZKN:beschrijving xsi:nil="true" />
                            <ZKN:formaat xsi:nil="true" />
                            <ZKN:taal xsi:nil="true" />
                            <ZKN:versie xsi:nil="true" />
                            <ZKN:status xsi:nil="true" />
                            <ZKN:verzenddatum xsi:nil="true" />
                            <ZKN:vertrouwelijkAanduiding xsi:nil="true" />
                            <ZKN:auteur xsi:nil="true" />
                            <ZKN:link xsi:nil="true" />
                        </ZKN:gerelateerde>
                        <ZKN:titel xsi:nil="true" />
                        <ZKN:beschrijving xsi:nil="true" />
                        <ZKN:registratiedatum xsi:nil="true" />
                        <ZKN:stt.volgnummer xsi:nil="true" />
                        <ZKN:stt.omschrijving xsi:nil="true" />
                        <ZKN:sta.datumStatusGezet xsi:nil="true" />
                    </ZKN:heeftRelevant>
                </ZKN:object>
            </ZKN:scope>
        </ZKN:zakLv01>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>